package faang.school.postservice.service;

public class CommentService {
    /*Требования:

Комментарии могут оставлять только конкретные пользователи под любыми постами.

Комментарий можно создать. Он не может быть пустым и длиннее 4096 символов.
У него обязательно должен быть автор — существующий пользователь.
Комментарий обязательно должен относиться к посту. Также у комментария есть дата создания.

Комментарий можно обновить. Если пользователь допустил ошибку в тексте комментария,
то он может изменить его. Все остальные данные изменить нельзя, и это важная проверка для бэкенда.

Можно получить все комментария для конкретного поста по id этого поста.
Комментарии должны быть отсортированы в хронологическом порядке от самого позднего к самому раннему.

Комментарий можно удалить. Пока без проверок, что его может удалить только сам автор.
 Позднее мы добавим все проверки, когда познакомимся с web компонентами, а в частности с сессией пользователя.
     */


}
